spring2018/psyc5301/psyc5301-spring2018.org
#+TITLE: PSYC 5301: Research Methods
#+AUTHOR: 
#+DATE: Spring 2018
#+OPTIONS: toc:nil
#+OPTIONS: num:nil
#+LATEX_CLASS: article
#+LATEX_CLASS_OPTIONS: [10pt]
#+LATEX_HEADER: \usepackage[left=1in,right=1in,bottom=1in,top=1in]{geometry}

** Contact info
- Professor: Thomas J. Faulkenberry, Ph.D
- Office: Math 319
- Office hours: MWF 1-3 pm, TR 9-11 am
- Email: faulkenberry@tarleton.edu
- Website: [[http://tomfaulkenberry.github.io]]
- Phone: 254-968-9816

** Course description

This course is designed to provide the student with a solid grounding in the techniques of experimentation and subsequent statistical modeling that form the empirical basis of modern psychological science.  In addition, we will discuss much of the /philosophical/ underpinning of modern scientific inference.  We will accomplish this through lectures, textbook reading, discussions, and several hands-on "laboratory" experiences, each designed to give the student a taste of the research process, including data collection, analysis, and reporting. All students enrolled in this course are required to have *previously taken* PSYC 5300 (Behavioral Statistics) or have equivalent statistical background.  Note that we will meet face-to-face approximately once every two weeks (see schedule below). 

** Course materials

- /Understanding Psychology as a Science: An Introduction to Scientific and Statistical Inference/ by Zoltan Dienes [[https://www.amazon.com/Understanding-Psychology-Science-Introduction-Statistical/dp/023054231X][Amazon link]]
- /APA Publication Manual/ (6th ed.) [[http://www.amazon.com/Publication-Manual-American-Psychological-Association/dp/1433805618/][Amazon link]]
- OpenSesame experiment building software (free download from [[http://osdoc.cogsci.nl/3.1/download/][osdoc.cogsci.nl]].  Make sure your version is at least 3.1.9.
- JASP statistical software (free download from [[http://jasp-stats.org][jasp-stats.org]]).  Make sure your version is at least 0.8.

** Student learning outcomes

1. Understand the classical frameworks of inference in psychological research
2. Develop research questions and translate those to testable hypotheses
3. Collect data using a variety of standard research paradigms
4. Analyze data using computer software
5. Communicate research results as a complete APA style manuscript
6. Develop a research prospectus

** Requirements and grading
- Online quizzes (50 points)
- Labs (100 points)
- Online discussions (100 points)
- Research prospectus (100 points)
- Class participation (50 points)
- /Total = 400 points/

Grades will be assigned based on the percentage of points you accumulate 
out of these 400 points.  I will use the standard grading scale of A=90%, 
B=80%, etc.

*** Online quizzes (12.5% of grade)
As this is a graduate level research methods course, there is some certain prerequisite knowledge that I expect you to have. However, it is possible that certain things may have been forgotten (or never studied) from your undergraduate studies. To help you get up to speed with this basic prerequisite knowledge, I have designed a set of 5 online quizzes that cover this basic content.  There are also lecture videos that accompany these quizzes.  You may progress through the quizzes at your own pace, so long as they are all completed by midterm.  They are also progressive; you must obtain a grade of at least 8/10 to gain access to the next quiz.  You may retake the quizzes as many times as necessary; just be aware that the recorded grade is the /last/ one you take.

*** Labs (25% of grade)
There will be two lab assignments this semester.  The purpose of these assignments is to familiarize you with the complete research process, from collecting data to analyzing the data and writing up the resulting manuscript. The labs will involve the basic designs used in much of the psychological literature, including independent groups designs, repeated measures designs, and factorial designs.  Each lab is worth 50 points (10 points for the data you collect and 40 points for the resulting manuscript). 

