spring2018/psyc5301/psyc5301-spring2018.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>PSYC 5301: Research Methods</title>
<!-- 2018-01-11 Thu 09:40 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
</head>
<body>
<div id="content">
<h1 class="title">PSYC 5301: Research Methods</h1>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Contact info</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>Professor: Thomas J. Faulkenberry, Ph.D
</li>
<li>Office: Math 319
</li>
<li>Office hours: MTWRF 1-3 pm
</li>
<li>Email: faulkenberry@tarleton.edu
</li>
<li>Website: <a href="http://tomfaulkenberry.github.io">http://tomfaulkenberry.github.io</a>
</li>
<li>Phone: 254-968-9816
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">Course description</h2>
<div class="outline-text-2" id="text-2">
<p>
This course is designed to provide the student with a solid grounding in the techniques of experimentation and subsequent statistical modeling that form the empirical basis of modern psychological science.  In addition, we will discuss much of the <i>philosophical</i> underpinning of modern scientific inference.  We will accomplish this through lectures, textbook reading, discussions, and several hands-on "laboratory" experiences, each designed to give the student a taste of the research process, including data collection, analysis, and reporting. All students enrolled in this course are required to have <b>previously taken</b> PSYC 5300 (Behavioral Statistics) or have equivalent statistical background.  Note that we will meet face-to-face approximately once every two weeks (see schedule below). 
</p>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">Course materials</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li><i>Understanding Psychology as a Science: An Introduction to Scientific and Statistical Inference</i> by Zoltan Dienes <a href="https://www.amazon.com/Understanding-Psychology-Science-Introduction-Statistical/dp/023054231X">Amazon link</a>
</li>
<li><i>APA Publication Manual</i> (6th ed.) <a href="http://www.amazon.com/Publication-Manual-American-Psychological-Association/dp/1433805618/">Amazon link</a>
</li>
<li>OpenSesame experiment building software (free download from <a href="http://osdoc.cogsci.nl/3.1/download/">osdoc.cogsci.nl</a>.  Make sure your version is at least 3.1.9.
</li>
<li>JASP statistical software (free download from <a href="http://jasp-stats.org">jasp-stats.org</a>).  Make sure your version is at least 0.8.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4">Student learning outcomes</h2>
<div class="outline-text-2" id="text-4">
<ol class="org-ol">
<li>Understand the classical frameworks of inference in psychological research
</li>
<li>Develop research questions and translate those to testable hypotheses
</li>
<li>Collect data using a variety of standard research paradigms
</li>
<li>Analyze data using computer software
</li>
<li>Communicate research results as a complete APA style manuscript
</li>
<li>Develop a research prospectus
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5">Requirements and grading</h2>
<div class="outline-text-2" id="text-5">
<ul class="org-ul">
<li>Online quizzes (50 points)
</li>
<li>Labs (100 points)
</li>
<li>Online discussions (100 points)
</li>
<li>Research prospectus (100 points)
</li>
<li>Class participation (50 points)
</li>
<li><i>Total = 400 points</i>
</li>
</ul>

<p>
Grades will be assigned based on the percentage of points you accumulate 
out of these 400 points.  I will use the standard grading scale of A=90%, 
B=80%, etc.
</p>
</div>

<div id="outline-container-sec-5-1" class="outline-3">
<h3 id="sec-5-1">Online quizzes (12.5% of grade)</h3>
<div class="outline-text-3" id="text-5-1">
<p>
As this is a graduate level research methods course, there is some certain prerequisite knowledge that I expect you to have. However, it is possible that certain things may have been forgotten (or never studied) from your undergraduate studies. To help you get up to speed with this basic prerequisite knowledge, I have designed a set of 5 online quizzes that cover this basic content.  There are also lecture videos that accompany these quizzes.  You may progress through the quizzes at your own pace, so long as they are all completed by midterm.  They are also progressive; you must obtain a grade of at least 8/10 to gain access to the next quiz.  You may retake the quizzes as many times as necessary; just be aware that the recorded grade is the <i>last</i> one you take.
</p>
</div>
</div>

<div id="outline-container-sec-5-2" class="outline-3">
<h3 id="sec-5-2">Labs (25% of grade)</h3>
<div class="outline-text-3" id="text-5-2">
<p>
There will be two lab assignments this semester.  The purpose of these assignments is to familiarize you with the complete research process, from collecting data to analyzing the data and writing up the resulting manuscript. The labs will involve the basic designs used in much of the psychological literature, including independent groups designs, repeated measures designs, and factorial designs.  Each lab is worth 50 points (10 points for the data you collect and 40 points for the resulting manuscript). 
</p>
</div>
</div>
