spring2018/psyc5301/psyc5301-spring2018.tex
% Created 2018-01-11 Thu 09:40
\documentclass[10pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{fixltx2e}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{float}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{marvosym}
\usepackage{wasysym}
\usepackage{amssymb}
\usepackage{hyperref}
\tolerance=1000
\usepackage[left=1in,right=1in,bottom=1in,top=1in]{geometry}
\date{Spring 2018}
\title{PSYC 5301: Research Methods}
\hypersetup{
  pdfkeywords={},
  pdfsubject={},
  pdfcreator={Emacs 25.3.1 (Org mode 8.2.10)}}
\begin{document}

\maketitle

\section*{Contact info}
\label{sec-1}
\begin{itemize}
\item Professor: Thomas J. Faulkenberry, Ph.D
\item Office: Math 319
\item Office hours: MTWRF 1-3 pm
\item Email: faulkenberry@tarleton.edu
\item Website: \url{http://tomfaulkenberry.github.io}
\item Phone: 254-968-9816
\end{itemize}

\section*{Course description}
\label{sec-2}

This course is designed to provide the student with a solid grounding in the techniques of experimentation and subsequent statistical modeling that form the empirical basis of modern psychological science.  In addition, we will discuss much of the \emph{philosophical} underpinning of modern scientific inference.  We will accomplish this through lectures, textbook reading, discussions, and several hands-on "laboratory" experiences, each designed to give the student a taste of the research process, including data collection, analysis, and reporting. All students enrolled in this course are required to have \textbf{previously taken} PSYC 5300 (Behavioral Statistics) or have equivalent statistical background.  Note that we will meet face-to-face approximately once every two weeks (see schedule below). 

\section*{Course materials}
\label{sec-3}

\begin{itemize}
\item \emph{Understanding Psychology as a Science: An Introduction to Scientific and Statistical Inference} by Zoltan Dienes \href{https://www.amazon.com/Understanding-Psychology-Science-Introduction-Statistical/dp/023054231X}{Amazon link}
\item \emph{APA Publication Manual} (6th ed.) \href{http://www.amazon.com/Publication-Manual-American-Psychological-Association/dp/1433805618/}{Amazon link}
\item OpenSesame experiment building software (free download from \href{http://osdoc.cogsci.nl/3.1/download/}{osdoc.cogsci.nl}.  Make sure your version is at least 3.1.9.
\item JASP statistical software (free download from \href{http://jasp-stats.org}{jasp-stats.org}).  Make sure your version is at least 0.8.
\end{itemize}

\section*{Student learning outcomes}
\label{sec-4}

\begin{enumerate}
\item Understand the classical frameworks of inference in psychological research
\item Develop research questions and translate those to testable hypotheses
\item Collect data using a variety of standard research paradigms
\item Analyze data using computer software
\item Communicate research results as a complete APA style manuscript
\item Develop a research prospectus
\end{enumerate}

\section*{Requirements and grading}
\label{sec-5}
\begin{itemize}
\item Online quizzes (50 points)
\item Labs (100 points)
\item Online discussions (100 points)
\item Research prospectus (100 points)
\item Class participation (50 points)
\item \emph{Total = 400 points}
\end{itemize}

Grades will be assigned based on the percentage of points you accumulate 
out of these 400 points.  I will use the standard grading scale of A=90\%, 
B=80\%, etc.

\subsection*{Online quizzes (12.5\% of grade)}
\label{sec-5-1}
As this is a graduate level research methods course, there is some certain prerequisite knowledge that I expect you to have. However, it is possible that certain things may have been forgotten (or never studied) from your undergraduate studies. To help you get up to speed with this basic prerequisite knowledge, I have designed a set of 5 online quizzes that cover this basic content.  There are also lecture videos that accompany these quizzes.  You may progress through the quizzes at your own pace, so long as they are all completed by midterm.  They are also progressive; you must obtain a grade of at least 8/10 to gain access to the next quiz.  You may retake the quizzes as many times as necessary; just be aware that the recorded grade is the \emph{last} one you take.

\subsection*{Labs (25\% of grade)}
\label{sec-5-2}
There will be two lab assignments this semester.  The purpose of these assignments is to familiarize you with the complete research process, from collecting data to analyzing the data and writing up the resulting manuscript. The labs will involve the basic designs used in much of the psychological literature, including independent groups designs, repeated measures designs, and factorial designs.  Each lab is worth 50 points (10 points for the data you collect and 40 points for the resulting manuscript). 
