spring2018/psyc5301/psyc5301-spring2018.html

<div id="outline-container-sec-5-3" class="outline-3">
<h3 id="sec-5-3">Online discussions (25% of grade)</h3>
<div class="outline-text-3" id="text-5-3">
<p>
Every online week (i.e., weeks we are not meeting in Stephenville; see below), you will be assigned a reading from the textbook and/or other external papers.  To ensure sufficient understanding of the readings, you will participate in an online discussion.  These discussions will revolve around a small number of prompts, to which you will be required to (1) compose your response, and (2) respond to your classmates.  The grades will be assigned largely on a <i>completion</i> basis, but substantive responses are required.  You <i>cannot</i> simply respond "I agree" or "I disagree"&#x2026;you must substantiate your response(s) with data and/or a logical argument. 
</p>
</div>
</div>

<div id="outline-container-sec-5-4" class="outline-3">
<h3 id="sec-5-4">Research prospectus (25% of grade)</h3>
<div class="outline-text-3" id="text-5-4">
<p>
In order to complete the research component of your MS degree, you will have to complete a thesis or applied project.  To help you in your planning for this work next year, you will complete a <i>research prospectus</i> in this course.  The prospectus (also called a <i>concept paper</i>) will describe a research study that you could potentially propose to carry out as your thesis or applied project.  The prospectus will roughly consist of the first three sections of a standard research manuscript: an <i>introduction</i> where you introduce a question for research and review the past research that sets up the question; a <i>method</i> section, where you describe the methods you will use to answer the question; and a <i>results</i> section, where you discuss how you will analyze the results of your study.  The study you propose must be <i>quantitative</i> and use methods that reflect the scientific nature of our discipline. 
</p>
</div>
</div>

<div id="outline-container-sec-5-5" class="outline-3">
<h3 id="sec-5-5">Class participation (12.5% of grade)</h3>
<div class="outline-text-3" id="text-5-5">
<p>
This is a very active course.  It is essential that you participate in <i>all</i> activities, both online and in our face-to-face sessions.  Your class participation grade will be reflective of the effort that I've seen you put into the course. Most people will earn all 50 possible points, but I reserve the right to lower this grade if you miss excessive class meetings. 
</p>

<p>
Please note that we will meet <i>in Stephenville</i> on the following dates:
</p>
<ul class="org-ul">
<li>Jan 16
</li>
<li>Jan 30
</li>
<li>Feb 13
</li>
<li>Feb 27
</li>
<li>Mar 27
</li>
<li>Apr 10
</li>
<li>Apr 24
</li>
<li>May 8
</li>
</ul>
</div>
</div>
</div>


<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6">Course Communication</h2>
<div class="outline-text-2" id="text-6">
<p>
Email is the primary means of official communication for this course.  If you have questions about the course, always feel free to send me an email at faulkenberry@tarleton.edu.  I only ask that you adhere to two guidelines:
</p>
<ul class="org-ul">
<li>please include the course number (PSYC 5301) in the subject line.  For example, one good way to do this is:  Subject: [PSYC 5301] Question about Lab 2
</li>
<li>please use proper email etiquette.  Include a salutation (e.g., Dear Dr. Faulkenberry), complete sentences, and a closing (e.g., "Regards, Your Name").  You might be surprised how many times I get an email from a nondescript email address with no indication from WHOM the email was sent!
</li>
</ul>

<p>
Also, I will send periodic class announcements via email.  Thus, it is imperative that you check your <i>Tarleton email address</i> regularly so that you don't miss any of these messages.
</p>
</div>
</div>

<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7">University Policy on "F" Grades</h2>
<div class="outline-text-2" id="text-7">
<p>
Beginning in Fall 2015, Tarleton began differentiating between a failed grade in a class because a student never attended (F0 grade), stopped attending at some point in the semester (FX grade), or because the student did not pass the course (F) but attended the entire semester. These grades will be noted on the official transcript. Stopping or never attending class can result in the student having to return aid monies received.  For more information see the Tarleton Financial Aid website.
</p>
</div>
</div>

<div id="outline-container-sec-8" class="outline-2">
<h2 id="sec-8">Academic Honesty</h2>
<div class="outline-text-2" id="text-8">
<p>
Cheating, plagiarism (submitting another person’s materials or ideas as one’s own without proper attribution), or doing work for another person who will receive academic credit are all disallowed. This includes the use of unauthorized books, notebooks, or other sources in order to secure of give help during an examination, the unauthorized copying of examinations, assignments, reports, or term papers, or the presentation of unacknowledged material as if it were the student’s own work. Disciplinary action may be taken beyond the academic discipline administered by the faculty member who teaches the course in which the cheating took place.
</p>

<p>
In particular, any quiz or exam taken online must be completed without the aid of any unauthorized resource (including using any search engine, Google, etc.).  Authorized resources are limited only to the official textbook and any lecture notes from the course.  Any other authorized resources will be provided to you before the exam.  
</p>

<p>
The minimum sanction for <i>any</i> act of academic dishonesty is a grade of 0 on the affected assignment; a grade of F for the course may be assigned in severe cases.
</p>
</div>
</div>

<div id="outline-container-sec-9" class="outline-2">
<h2 id="sec-9">Academic Affairs Core Value Statements</h2>
