spring2018/psyc5301/psyc5301-spring2018.tex

\subsection*{Online discussions (25\% of grade)}
\label{sec-5-3}
Every online week (i.e., weeks we are not meeting in Stephenville; see below), you will be assigned a reading from the textbook and/or other external papers.  To ensure sufficient understanding of the readings, you will participate in an online discussion.  These discussions will revolve around a small number of prompts, to which you will be required to (1) compose your response, and (2) respond to your classmates.  The grades will be assigned largely on a \emph{completion} basis, but substantive responses are required.  You \emph{cannot} simply respond "I agree" or "I disagree"\ldots{}you must substantiate your response(s) with data and/or a logical argument. 

\subsection*{Research prospectus (25\% of grade)}
\label{sec-5-4}
In order to complete the research component of your MS degree, you will have to complete a thesis or applied project.  To help you in your planning for this work next year, you will complete a \emph{research prospectus} in this course.  The prospectus (also called a \emph{concept paper}) will describe a research study that you could potentially propose to carry out as your thesis or applied project.  The prospectus will roughly consist of the first three sections of a standard research manuscript: an \emph{introduction} where you introduce a question for research and review the past research that sets up the question; a \emph{method} section, where you describe the methods you will use to answer the question; and a \emph{results} section, where you discuss how you will analyze the results of your study.  The study you propose must be \emph{quantitative} and use methods that reflect the scientific nature of our discipline. 

\subsection*{Class participation (12.5\% of grade)}
\label{sec-5-5}
This is a very active course.  It is essential that you participate in \emph{all} activities, both online and in our face-to-face sessions.  Your class participation grade will be reflective of the effort that I've seen you put into the course. Most people will earn all 50 possible points, but I reserve the right to lower this grade if you miss excessive class meetings. 

Please note that we will meet \emph{in Stephenville} on the following dates:
\begin{itemize}
\item Jan 16
\item Jan 30
\item Feb 13
\item Feb 27
\item Mar 27
\item Apr 10
\item Apr 24
\item May 8
\end{itemize}


\section*{Course Communication}
\label{sec-6}

Email is the primary means of official communication for this course.  If you have questions about the course, always feel free to send me an email at faulkenberry@tarleton.edu.  I only ask that you adhere to two guidelines:
\begin{itemize}
\item please include the course number (PSYC 5301) in the subject line.  For example, one good way to do this is:  Subject: [PSYC 5301] Question about Lab 2
\item please use proper email etiquette.  Include a salutation (e.g., Dear Dr. Faulkenberry), complete sentences, and a closing (e.g., "Regards, Your Name").  You might be surprised how many times I get an email from a nondescript email address with no indication from WHOM the email was sent!
\end{itemize}

Also, I will send periodic class announcements via email.  Thus, it is imperative that you check your \emph{Tarleton email address} regularly so that you don't miss any of these messages.

\section*{University Policy on "F" Grades}
\label{sec-7}

Beginning in Fall 2015, Tarleton began differentiating between a failed grade in a class because a student never attended (F0 grade), stopped attending at some point in the semester (FX grade), or because the student did not pass the course (F) but attended the entire semester. These grades will be noted on the official transcript. Stopping or never attending class can result in the student having to return aid monies received.  For more information see the Tarleton Financial Aid website.

\section*{Academic Honesty}
\label{sec-8}

Cheating, plagiarism (submitting another person’s materials or ideas as one’s own without proper attribution), or doing work for another person who will receive academic credit are all disallowed. This includes the use of unauthorized books, notebooks, or other sources in order to secure of give help during an examination, the unauthorized copying of examinations, assignments, reports, or term papers, or the presentation of unacknowledged material as if it were the student’s own work. Disciplinary action may be taken beyond the academic discipline administered by the faculty member who teaches the course in which the cheating took place.

In particular, any quiz or exam taken online must be completed without the aid of any unauthorized resource (including using any search engine, Google, etc.).  Authorized resources are limited only to the official textbook and any lecture notes from the course.  Any other authorized resources will be provided to you before the exam.  

The minimum sanction for \emph{any} act of academic dishonesty is a grade of 0 on the affected assignment; a grade of F for the course may be assigned in severe cases.

\section*{Academic Affairs Core Value Statements}
\label{sec-9}
