spring2018/psyc5301/psyc5301-spring2018.html
<div class="outline-text-2" id="text-9">
</div><div id="outline-container-sec-9-1" class="outline-3">
<h3 id="sec-9-1">Academic Integrity Statement</h3>
<div class="outline-text-3" id="text-9-1">
<p>
Tarleton State University's core values are integrity, leadership, tradition, civility, excellence, and service.  Central to these values is integrity, which is maintaining a high standard of personal and scholarly conduct.  Academic integrity represents the choice to uphold ethical responsibility for one’s learning within the academic community, regardless of audience or situation.
</p>
</div>
</div>

<div id="outline-container-sec-9-2" class="outline-3">
<h3 id="sec-9-2">Academic Civility Statement</h3>
<div class="outline-text-3" id="text-9-2">
<p>
Students are expected to interact with professors and peers in a respectful manner that enhances the learning environment. Professors may require a student who deviates from this expectation to leave the face-to-face (or virtual) classroom learning environment for that particular class session (and potentially subsequent class sessions) for a specific amount of time. In addition, the professor might consider the university disciplinary process (for Academic Affairs/Student Life) for egregious or continued disruptive behavior.
</p>
</div>
</div>

<div id="outline-container-sec-9-3" class="outline-3">
<h3 id="sec-9-3">Academic Excellence Statement</h3>
<div class="outline-text-3" id="text-9-3">
<p>
Tarleton holds high expectations for students to assume responsibility for their own individual learning. Students are also expected to achieve academic excellence by:
</p>
<ul class="org-ul">
<li>honoring Tarleton’s core values, upholding high standards of habit and behavior.
</li>
<li>maintaining excellence through class attendance and punctuality, preparing for active participation in all learning experiences. 
</li>
<li>putting forth their best individual effort.
</li>
<li>continually improving as independent learners.
</li>
<li>engaging in extracurricular opportunities that encourage personal and academic growth.
</li>
<li>reflecting critically upon feedback and applying these lessons to meet future challenges.
</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-sec-10" class="outline-2">
<h2 id="sec-10">Students with Disabilities Policy</h2>
<div class="outline-text-2" id="text-10">
<p>
It is the policy of Tarleton State University to comply with the Americans with Disabilities Act and other applicable laws. If you are a student with a disability seeking accommodations for this course, please contact the Center for Access and Academic Testing, at 254.968.9400 or caat@tarleton.edu. The office is located in Math 201. More information can be found at www.tarleton.edu/caat or in the University Catalog.
</p>

<p>
<b><b>Note:  any changes to this syllabus will be communicated to you by the instructor!</b></b>
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: Spring 2018</p>
<p class="date">Created: 2018-01-11 Thu 09:40</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 25.3.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
